RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_hal_rtc.h
  uint32_t AlarmSubSecondMask;   /*!< Specifies the RTC Alarm SubSeconds Masks.
                                      This parameter can be a value of @ref RTC_Alarm_Sub_Seconds_Masks_Definitions */

  uint32_t AlarmDateWeekDaySel;  /*!< Specifies the RTC Alarm is on Date or WeekDay.
                                     This parameter can be a value of @ref RTC_AlarmDateWeekDay_Definitions */

  uint8_t AlarmDateWeekDay;      /*!< Specifies the RTC Alarm Date/WeekDay.
                                      If the Alarm Date is selected, this parameter must be set to a value in the 1-31 range.
                                      If the Alarm WeekDay is selected, this parameter can be a value of @ref RTC_WeekDay_Definitions */

  uint32_t Alarm;                /*!< Specifies the alarm .
                                      This parameter can be a value of @ref RTC_Alarms_Definitions */
} RTC_AlarmTypeDef;

/**
  * @brief  RTC Handle Structure definition
  */
#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
typedef struct __RTC_HandleTypeDef
#else
typedef struct
#endif /* (USE_HAL_RTC_REGISTER_CALLBACKS) */
{
  RTC_TypeDef               *Instance;  /*!< Legacy register base address. Not used anymore,
                                             the driver directly uses cmsis base address */

  RTC_InitTypeDef           Init;       /*!< RTC required parameters  */

  HAL_LockTypeDef           Lock;       /*!< RTC locking object       */

  __IO HAL_RTCStateTypeDef  State;      /*!< Time communication state */

#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
  void (* AlarmAEventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Alarm A Event callback           */
  void (* AlarmBEventCallback)(struct __RTC_HandleTypeDef *hrtc);                   /*!< RTC Alarm B Event callback           */
  void (* TimeStampEventCallback)(struct __RTC_HandleTypeDef *hrtc);                /*!< RTC TimeStamp Event callback         */
  void (* WakeUpTimerEventCallback)(struct __RTC_HandleTypeDef *hrtc);              /*!< RTC WakeUpTimer Event callback       */

  void (* Tamper1EventCallback)(struct __RTC_HandleTypeDef *hrtc);                  /*!< RTC Tamper 1 Event callback          */
  void (* Tamper2EventCallback)(struct __RTC_HandleTypeDef *hrtc);                  /*!< RTC Tamper 2 Event callback          */
#if (RTC_TAMP_NB == 3)
  void (* Tamper3EventCallback)(struct __RTC_HandleTypeDef *hrtc);                  /*!< RTC Tamper 3 Event callback          */
#endif /* RTC_TAMP_NB */
  void (* InternalTamper1EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 1 Event callback */
#ifdef RTC_TAMP_INT_2_SUPPORT
  void (* InternalTamper2EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 2 Event callback */
#endif /* RTC_TAMP_INT_2_SUPPORT */
  void (* InternalTamper3EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 3 Event callback */
  void (* InternalTamper4EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 4 Event callback */
  void (* InternalTamper5EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 5 Event callback */
#ifdef RTC_TAMP_INT_6_SUPPORT
  void (* InternalTamper6EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 6 Event callback */
#endif /* RTC_TAMP_INT_6_SUPPORT */
#ifdef RTC_TAMP_INT_7_SUPPORT
  void (* InternalTamper7EventCallback)(struct __RTC_HandleTypeDef *hrtc);          /*!< RTC Internal Tamper 7 Event callback */
#endif /* RTC_TAMP_INT_7_SUPPORT */

  void (* MspInitCallback)(struct __RTC_HandleTypeDef *hrtc);                       /*!< RTC Msp Init callback                */
  void (* MspDeInitCallback)(struct __RTC_HandleTypeDef *hrtc);                     /*!< RTC Msp DeInit callback              */

#endif /* (USE_HAL_RTC_REGISTER_CALLBACKS) */

} RTC_HandleTypeDef;

#if (USE_HAL_RTC_REGISTER_CALLBACKS == 1)
/**
  * @brief  HAL LPTIM Callback ID enumeration definition
  */
typedef enum
{
  HAL_RTC_ALARM_A_EVENT_CB_ID           = 0x00U,    /*!< RTC Alarm A Event Callback ID      */
  HAL_RTC_ALARM_B_EVENT_CB_ID           = 0x01U,    /*!< RTC Alarm B Event Callback ID      */
  HAL_RTC_TIMESTAMP_EVENT_CB_ID         = 0x02U,    /*!< RTC TimeStamp Event Callback ID    */
  HAL_RTC_WAKEUPTIMER_EVENT_CB_ID       = 0x03U,    /*!< RTC WakeUp Timer Event Callback ID */
  HAL_RTC_TAMPER1_EVENT_CB_ID           = 0x04U,    /*!< RTC Tamper 1 Callback ID           */
  HAL_RTC_TAMPER2_EVENT_CB_ID           = 0x05U,    /*!< RTC Tamper 2 Callback ID           */
  HAL_RTC_TAMPER3_EVENT_CB_ID           = 0x06U,    /*!< RTC Tamper 3 Callback ID           */
  HAL_RTC_INTERNAL_TAMPER1_EVENT_CB_ID  = 0x07U,    /*!< RTC Internal Tamper 1 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER2_EVENT_CB_ID  = 0x08U,    /*!< RTC Internal Tamper 2 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER3_EVENT_CB_ID  = 0x09U,    /*!< RTC Internal Tamper 3 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER4_EVENT_CB_ID  = 0x0AU,    /*!< RTC Internal Tamper 4 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER5_EVENT_CB_ID  = 0x0BU,    /*!< RTC Internal Tamper 5 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER6_EVENT_CB_ID  = 0x0CU,    /*!< RTC Internal Tamper 6 Callback ID  */
  HAL_RTC_INTERNAL_TAMPER7_EVENT_CB_ID  = 0x0DU,    /*!< RTC Internal Tamper 7 Callback ID  */
  HAL_RTC_MSPINIT_CB_ID                 = 0x0EU,    /*!< RTC Msp Init callback ID           */
  HAL_RTC_MSPDEINIT_CB_ID               = 0x0FU     /*!< RTC Msp DeInit callback ID         */
} HAL_RTC_CallbackIDTypeDef;

/**
  * @brief  HAL RTC Callback pointer definition
  */
typedef  void (*pRTC_CallbackTypeDef)(RTC_HandleTypeDef *hrtc); /*!< pointer to an RTC callback function */
#endif /* USE_HAL_RTC_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/
/** @defgroup RTC_Exported_Constants RTC Exported Constants
  * @{
  */

/** @defgroup RTC_Hour_Formats RTC Hour Formats
  * @{
  */
#define RTC_HOURFORMAT_24                   0x00000000U
#define RTC_HOURFORMAT_12                   RTC_CR_FMT
/**
  * @}
  */

